IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
<module name="MCAN1_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_CREL" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_CREL" offset="0x0" width="32" description="Release dependent constant (version + date)">
		<bitfield id="REL" width="4" begin="31" end="28" resetval="0x3" description="Core Release" range="31 - 28" rwaccess="R"/> 
		<bitfield id="STEP" width="4" begin="27" end="24" resetval="0x2" description="Step of Core Release" range="27 - 24" rwaccess="R"/> 
		<bitfield id="SUBSTEP" width="4" begin="23" end="20" resetval="0x3" description="Sub-Step of Core Release" range="23 - 20" rwaccess="R"/> 
		<bitfield id="YEAR" width="4" begin="19" end="16" resetval="0x8" description="Time Stamp Year" range="19 - 16" rwaccess="R"/> 
		<bitfield id="MON" width="8" begin="15" end="8" resetval="0x6" description="Time Stamp Month" range="15 - 8" rwaccess="R"/> 
		<bitfield id="DAY" width="8" begin="7" end="0" resetval="0x8" description="Time Stamp Day" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ENDN" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ENDN" offset="0x4" width="32" description="Constant 0x8765 4321">
		<bitfield id="ETV" width="32" begin="31" end="0" resetval="0x2271560481" description="Endianess test value" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_CUST" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_CUST" offset="0x8" width="32" description="Optional customer-specific register">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_DBTP" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_DBTP" offset="0xC" width="32" description="Configuration of data phase bit timing, transmitter delay compensation enable">
		<bitfield id="TDC" width="1" begin="23" end="23" resetval="0x0" description="Transmitter Delay Compensation" range="23" rwaccess="R/W"/> 
		<bitfield id="DBRP" width="5" begin="20" end="16" resetval="0x0" description="Data Baud Rate Prescaler" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="DTSEG1" width="5" begin="12" end="8" resetval="0x10" description="Data time segment before sample point" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="DTSEG2" width="4" begin="7" end="4" resetval="0x3" description="Data time segment after sample point" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="DSJW" width="4" begin="3" end="0" resetval="0x3" description="Data resynchronization Jump Width" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TEST" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TEST" offset="0x10" width="32" description="Test mode selection">
		<bitfield id="RX" width="1" begin="7" end="7" resetval="0x0" description="Receive Pin" range="7" rwaccess="R"/> 
		<bitfield id="TX" width="2" begin="6" end="5" resetval="0x0" description="Control of Transmit Pin" range="6 - 5" rwaccess="R/W"/> 
		<bitfield id="LBCK" width="1" begin="4" end="4" resetval="0x0" description="Loop Back Mode" range="4" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RWD" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RWD" offset="0x14" width="32" description="Monitors the READY output of the Message RAM">
		<bitfield id="WDV" width="8" begin="15" end="8" resetval="0x0" description="Watchdog Value" range="15 - 8" rwaccess="R"/> 
		<bitfield id="WDC" width="8" begin="7" end="0" resetval="0x0" description="Watchdog Counter Value" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_CCCR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_CCCR" offset="0x18" width="32" description="Operation mode configuration">
		<bitfield id="NISO" width="1" begin="15" end="15" resetval="0x0" description="Non ISO Operation. 0= CAN FD frame format according to ISO 11898-1:2015. 1= CAN FD frame format according to Bosch CAN FD Specification 1.0" range="15" rwaccess="R/W"/> 
		<bitfield id="TXP" width="1" begin="14" end="14" resetval="0x0" description="Transmit Pause" range="14" rwaccess="R/W"/> 
		<bitfield id="EFBI" width="1" begin="13" end="13" resetval="0x0" description="Edge Filtering during Bus Integration" range="13" rwaccess="R/W"/> 
		<bitfield id="PXHD" width="1" begin="12" end="12" resetval="0x0" description="Protocol Exception Handling Disable" range="12" rwaccess="R/W"/> 
		<bitfield id="BRSE" width="1" begin="9" end="9" resetval="0x0" description="Bit Rate Switch Enable" range="9" rwaccess="R/W"/> 
		<bitfield id="FDOE" width="1" begin="8" end="8" resetval="0x0" description="FD Operation Enable" range="8" rwaccess="R/W"/> 
		<bitfield id="TEST" width="1" begin="7" end="7" resetval="0x0" description="Test Mode enable" range="7" rwaccess="R/W"/> 
		<bitfield id="DAR" width="1" begin="6" end="6" resetval="0x0" description="Disable Automatic Retransmission" range="6" rwaccess="R/W"/> 
		<bitfield id="MON" width="1" begin="5" end="5" resetval="0x0" description="Bus Monitoring Mode" range="5" rwaccess="R/W"/> 
		<bitfield id="CSR" width="1" begin="4" end="4" resetval="0x0" description="Clock Stop Request" range="4" rwaccess="R/W"/> 
		<bitfield id="CSA" width="1" begin="3" end="3" resetval="0x0" description="Clock Stop Acknowledge" range="3" rwaccess="R"/> 
		<bitfield id="ASM" width="1" begin="2" end="2" resetval="0x0" description="Restricted Operation Mode" range="2" rwaccess="R/W"/> 
		<bitfield id="CCE" width="1" begin="1" end="1" resetval="0x0" description="Configuration Change Enable" range="1" rwaccess="R/W"/> 
		<bitfield id="INIT" width="1" begin="0" end="0" resetval="0x1" description="Initialization" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_NBTP" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_NBTP" offset="0x1C" width="32" description="Configuration of arbitration phase bit timing">
		<bitfield id="NSJW" width="7" begin="31" end="25" resetval="0x3" description="Nominal Resynchronization Jump Width" range="31 - 25" rwaccess="R/W"/> 
		<bitfield id="NBRP" width="9" begin="24" end="16" resetval="0x0" description="Nominal Baud Rate Prescaler" range="24 - 16" rwaccess="R/W"/> 
		<bitfield id="NTSEG1" width="8" begin="15" end="8" resetval="0x10" description="Nominal Time segment before sample point" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="NTSEG2" width="7" begin="6" end="0" resetval="0x3" description="Nominal Time segment after sample point" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TSCC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TSCC" offset="0x20" width="32" description="Timestamp counter prescaler setting, selection of internal/external timestamp vector">
		<bitfield id="TCP" width="4" begin="19" end="16" resetval="0x0" description="Timestamp Counter Prescaler" range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="TSS" width="2" begin="1" end="0" resetval="0x0" description="Timestamp Select" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TSCV" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TSCV" offset="0x24" width="32" description="Read/reset timestamp counter">
		<bitfield id="TSC" width="16" begin="15" end="0" resetval="0x0" description="Timestamp Counter" range="15 - 0" rwaccess="R/WTC"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TOCC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TOCC" offset="0x28" width="32" description="Configuration of timeout period, selection of timeout counter operation mode">
		<bitfield id="TOP" width="16" begin="31" end="16" resetval="0x65535" description="Timeout Period" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TOS" width="2" begin="2" end="1" resetval="0x0" description="Timeout Select" range="2 - 1" rwaccess="R/W"/> 
		<bitfield id="ETOC" width="1" begin="0" end="0" resetval="0x0" description="Enable Timeout Counter" range="0" rwaccess="R/W"/>
	</register>
