IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TOCV" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TOCV" offset="0x2C" width="32" description="Read/reset timeout counter">
		<bitfield id="TOC" width="16" begin="15" end="0" resetval="0x65535" description="Timeout Counter" range="15 - 0" rwaccess="R/WTC"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved00" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved00" offset="0x30" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved11" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved11" offset="0x34" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved22" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved22" offset="0x38" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved33" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved33" offset="0x3C" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ECR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ECR" offset="0x40" width="32" description="State of Rx/Tx Error Counter, CAN Error Logging">
		<bitfield id="CEL" width="8" begin="23" end="16" resetval="0x0" description="CAN Error Logging" range="23 - 16" rwaccess="R"/> 
		<bitfield id="RP" width="1" begin="15" end="15" resetval="0x0" description="Receive Error Passive" range="15" rwaccess="R"/> 
		<bitfield id="REC" width="7" begin="14" end="8" resetval="0x0" description="Receive Error Counter" range="14 - 8" rwaccess="R"/> 
		<bitfield id="TEC" width="8" begin="7" end="0" resetval="0x0" description="Transmit Error Counter" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_PSR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_PSR" offset="0x44" width="32" description="CAN protocol controller status, transmitter delay compensation value">
		<bitfield id="TDCV" width="7" begin="22" end="16" resetval="0x0" description="Transmitter Delay Compensation Value" range="22 - 16" rwaccess="R"/> 
		<bitfield id="PXE" width="1" begin="14" end="14" resetval="0x0" description="Protocol Exception Event" range="14" rwaccess="R"/> 
		<bitfield id="RFDF" width="1" begin="13" end="13" resetval="0x0" description="Received a CAN FD Message" range="13" rwaccess="R"/> 
		<bitfield id="RBRS" width="1" begin="12" end="12" resetval="0x0" description="BRS flag of last received CAN FD Message" range="12" rwaccess="R"/> 
		<bitfield id="RESI" width="1" begin="11" end="11" resetval="0x0" description="ESI flag of last received CAN FD Message" range="11" rwaccess="R"/> 
		<bitfield id="DLEC" width="3" begin="10" end="8" resetval="0x7" description="Data Phase Last Error Code" range="10 - 8" rwaccess="R"/> 
		<bitfield id="BO" width="1" begin="7" end="7" resetval="0x0" description="Bus_Off status" range="7" rwaccess="R"/> 
		<bitfield id="EW" width="1" begin="6" end="6" resetval="0x0" description="Warning Status" range="6" rwaccess="R"/> 
		<bitfield id="EP" width="1" begin="5" end="5" resetval="0x0" description="Error Passive" range="5" rwaccess="R"/> 
		<bitfield id="ACT" width="2" begin="4" end="3" resetval="0x0" description="Activity" range="4 - 3" rwaccess="R"/> 
		<bitfield id="LEC" width="3" begin="2" end="0" resetval="0x7" description="Last Error Code" range="2 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TDCR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TDCR" offset="0x48" width="32" description="configuration of transmitter delay compensation offset and filter window length">
		<bitfield id="TDCO" width="7" begin="14" end="8" resetval="0x0" description="Transmitter Delay Compensation Offset" range="14 - 8" rwaccess="R/W"/> 
		<bitfield id="TDCF" width="7" begin="6" end="0" resetval="0x0" description="Transmitter Delay Compensation Filter Window Length" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved44" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved44" offset="0x4C" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_IR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_IR" offset="0x50" width="32" description="Interrupt flags">
		<bitfield id="ARA" width="1" begin="29" end="29" resetval="0x0" description="Access to Reserved Address" range="29" rwaccess="R/W1TC"/> 
		<bitfield id="PED" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in data Phase" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="PEA" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="WDI" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="BO" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="EW" width="1" begin="24" end="24" resetval="0x0" description="Warning Status" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="EP" width="1" begin="23" end="23" resetval="0x0" description="Error Passive" range="23" rwaccess="R/W1TC"/> 
		<bitfield id="ELO" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow" range="22" rwaccess="R/W1TC"/> 
		<bitfield id="BEU" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected" range="21" rwaccess="R/W1TC"/> 
		<bitfield id="DRX" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="TOO" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="MRAF" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="TSW" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="TEFL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Element Lost" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="TEFF" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="TEFW" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="TEFN" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="TFE" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="TCF" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finished" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="TC" width="1" begin="9" end="9" resetval="0x0" description="Transmission Complete" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="HPM" width="1" begin="8" end="8" resetval="0x0" description="High Priority Message" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="RF1L" width="1" begin="7" end="7" resetval="0x0" description="Rx FIFO 1 Message Lost" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="RF1F" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="RF1W" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="RF1N" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="RF0L" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="RF0F" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="RF0W" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="RF0N" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_IE" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_IE" offset="0x54" width="32" description="Interrupt enable/disable">
		<bitfield id="ARAE" width="1" begin="29" end="29" resetval="0x0" description="Access to Reserve Address Interrupt Enable" range="29" rwaccess="R/W"/> 
		<bitfield id="PEDE" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Enable" range="28" rwaccess="R/W"/> 
		<bitfield id="PEAE" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Enable" range="27" rwaccess="R/W"/> 
		<bitfield id="WDIE" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Enable" range="26" rwaccess="R/W"/> 
		<bitfield id="BOE" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Enable" range="25" rwaccess="R/W"/> 
		<bitfield id="EWE" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Enable" range="24" rwaccess="R/W"/> 
		<bitfield id="EPE" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Enable" range="23" rwaccess="R/W"/> 
		<bitfield id="ELOE" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Enable" range="22" rwaccess="R/W"/> 
		<bitfield id="BEUE" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Enable" range="21" rwaccess="R/W"/> 
		<bitfield id="BECE" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Enable" range="20" rwaccess="R/W"/> 
		<bitfield id="DRX" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Enable" range="19" rwaccess="R/W"/> 
		<bitfield id="TOOE" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Enable" range="18" rwaccess="R/W"/> 
		<bitfield id="MRAFE" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Enable" range="17" rwaccess="R/W"/> 
		<bitfield id="TSWE" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TEFLE" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Enable" range="15" rwaccess="R/W"/> 
		<bitfield id="TEFFE" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Enable" range="14" rwaccess="R/W"/> 
		<bitfield id="TEFWE" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt enable" range="13" rwaccess="R/W"/> 
		<bitfield id="TEFNE" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Enable" range="12" rwaccess="R/W"/> 
		<bitfield id="TFEE" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Enable" range="11" rwaccess="R/W"/> 
		<bitfield id="TCFE" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finished Interrupt Enable" range="10" rwaccess="R/W"/> 
		<bitfield id="TCE" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Enable" range="9" rwaccess="R/W"/> 
		<bitfield id="HPME" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RF1LE" width="1" begin="7" end="7" resetval="0x0" description="rx FIFO 1 Message Lost Interrupt Enable" range="7" rwaccess="R/W"/> 
		<bitfield id="RF1FE" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Enable" range="6" rwaccess="R/W"/> 
		<bitfield id="RF1WE" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Enable" range="5" rwaccess="R/W"/> 
		<bitfield id="RF1NE" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Enable" range="4" rwaccess="R/W"/> 
		<bitfield id="RF0LE" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Enable" range="3" rwaccess="R/W"/> 
		<bitfield id="RF0FE" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="RF0WE" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Enable" range="1" rwaccess="R/W"/> 
		<bitfield id="RF0NE" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Enable" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ILS" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ILS" offset="0x58" width="32" description="Interrupt line select (m_can_int0 or m_can_int1)">
		<bitfield id="ARAL" width="1" begin="29" end="29" resetval="0x0" description="Access to Reserve Address Interrupt Line" range="29" rwaccess="R/W"/> 
		<bitfield id="PEDL" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Line" range="28" rwaccess="R/W"/> 
		<bitfield id="PEAL" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Line" range="27" rwaccess="R/W"/> 
		<bitfield id="WDIL" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Line" range="26" rwaccess="R/W"/> 
		<bitfield id="BOL" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Line" range="25" rwaccess="R/W"/> 
		<bitfield id="EWL" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Line" range="24" rwaccess="R/W"/> 
		<bitfield id="EPL" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Line" range="23" rwaccess="R/W"/> 
		<bitfield id="ELOL" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Line" range="22" rwaccess="R/W"/> 
		<bitfield id="BEUL" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Line" range="21" rwaccess="R/W"/> 
		<bitfield id="BECL" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Line" range="20" rwaccess="R/W"/> 
		<bitfield id="DRXL" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Line" range="19" rwaccess="R/W"/> 
		<bitfield id="TOOL" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Line" range="18" rwaccess="R/W"/> 
		<bitfield id="MRAFL" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Line" range="17" rwaccess="R/W"/> 
		<bitfield id="TSWL" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Line" range="16" rwaccess="R/W"/> 
		<bitfield id="TEFLL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Line" range="15" rwaccess="R/W"/> 
		<bitfield id="TEFFL" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Line" range="14" rwaccess="R/W"/> 
		<bitfield id="TEFWL" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt Line" range="13" rwaccess="R/W"/> 
		<bitfield id="TEFNL" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Line" range="12" rwaccess="R/W"/> 
		<bitfield id="TFEL" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Line" range="11" rwaccess="R/W"/> 
		<bitfield id="TCFL" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finishied Interrupt Line" range="10" rwaccess="R/W"/> 
		<bitfield id="TCL" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Line" range="9" rwaccess="R/W"/> 
		<bitfield id="HPML" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Line" range="8" rwaccess="R/W"/> 
		<bitfield id="RF1LL" width="1" begin="7" end="7" resetval="0x0" description="rx FIFO 1 Message Lost Interrupt Line" range="7" rwaccess="R/W"/> 
		<bitfield id="RF1FL" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Line" range="6" rwaccess="R/W"/> 
		<bitfield id="RF1WL" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Line" range="5" rwaccess="R/W"/> 
		<bitfield id="RF1NL" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Line" range="4" rwaccess="R/W"/> 
		<bitfield id="RF0LL" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Line" range="3" rwaccess="R/W"/> 
		<bitfield id="RF0FL" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Line" range="2" rwaccess="R/W"/> 
		<bitfield id="RF0WL" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Line" range="1" rwaccess="R/W"/> 
		<bitfield id="RF0NL" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Line" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ILE" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ILE" offset="0x5C" width="32" description="Enable/disable interrupt lines m_can_int0 / m_can_int1">
		<bitfield id="EINT1" width="1" begin="1" end="1" resetval="0x0" description="Enable Interrupt Line 1" range="1" rwaccess="R/W"/> 
		<bitfield id="EINT0" width="1" begin="0" end="0" resetval="0x0" description="Enable Interrupt Line 0" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved55" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved55" offset="0x60" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved66" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved66" offset="0x64" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved77" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved77" offset="0x68" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved88" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved88" offset="0x6C" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved99" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved99" offset="0x70" width="32" description="Reserved field">
		
	</register>
