IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1010" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1010" offset="0x74" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1111" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1111" offset="0x78" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1212" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1212" offset="0x7C" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_GFC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_GFC" offset="0x80" width="32" description="Handling of non-matching frames and remote frames">
		<bitfield id="ANFS" width="2" begin="5" end="4" resetval="0x0" description="Accept Non-matching Frames Standard" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="ANFE" width="2" begin="3" end="2" resetval="0x0" description="Accept Non-matching Frames Extended" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="RRFS" width="1" begin="1" end="1" resetval="0x0" description="reject Remote Frames Standard" range="1" rwaccess="R/W"/> 
		<bitfield id="RRFE" width="1" begin="0" end="0" resetval="0x0" description="reject Remote Frames Extended" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_SIDFC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_SIDFC" offset="0x84" width="32" description="Number of filter elements, pointer to start of filter list">
		<bitfield id="LSS" width="8" begin="23" end="16" resetval="0x0" description="List Size Standard" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="FLSSA" width="14" begin="15" end="2" resetval="0x0" description="Filter List Standard Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_XIDFC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_XIDFC" offset="0x88" width="32" description="Number of filter elements, pointer to start of filter list">
		<bitfield id="LSE" width="7" begin="22" end="16" resetval="0x0" description="List Size Extended" range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="FLESA" width="14" begin="15" end="2" resetval="0x0" description="Filter List Extended Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1313" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1313" offset="0x8C" width="32" description="Reserved field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_XIDAM" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_XIDAM" offset="0x90" width="32" description="29-bit logical AND mask for J1939">
		<bitfield id="EIDM" width="29" begin="28" end="0" resetval="0x536870911" description="Extended ID Mask" range="28 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_HPMS" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_HPMS" offset="0x94" width="32" description="Status monitoring of incoming high priority messages">
		<bitfield id="FLST" width="1" begin="15" end="15" resetval="0x0" description="Filter List" range="15" rwaccess="R"/> 
		<bitfield id="FIDX" width="7" begin="14" end="8" resetval="0x0" description="Filter Index" range="14 - 8" rwaccess="R"/> 
		<bitfield id="MSI" width="2" begin="7" end="6" resetval="0x0" description="Message Storage Indicator" range="7 - 6" rwaccess="R"/> 
		<bitfield id="BIDX" width="6" begin="5" end="0" resetval="0x0" description="Buffer Index" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_NDAT1" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_NDAT1" offset="0x98" width="32" description="NewDat flags of dedicated Rx buffers 0-31">
		<bitfield id="ND31" width="1" begin="31" end="31" resetval="0x0" description="New Data" range="31" rwaccess="R/W1TC"/> 
		<bitfield id="ND30" width="1" begin="30" end="30" resetval="0x0" description="New Data" range="30" rwaccess="R/W1TC"/> 
		<bitfield id="ND29" width="1" begin="29" end="29" resetval="0x0" description="New Data" range="29" rwaccess="R/W1TC"/> 
		<bitfield id="ND28" width="1" begin="28" end="28" resetval="0x0" description="New Data" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="ND27" width="1" begin="27" end="27" resetval="0x0" description="New Data" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="ND26" width="1" begin="26" end="26" resetval="0x0" description="New Data" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="ND25" width="1" begin="25" end="25" resetval="0x0" description="New Data" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="ND24" width="1" begin="24" end="24" resetval="0x0" description="New Data" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="ND23" width="1" begin="23" end="23" resetval="0x0" description="New Data" range="23" rwaccess="R/W1TC"/> 
		<bitfield id="ND22" width="1" begin="22" end="22" resetval="0x0" description="New Data" range="22" rwaccess="R/W1TC"/> 
		<bitfield id="ND21" width="1" begin="21" end="21" resetval="0x0" description="New Data" range="21" rwaccess="R/W1TC"/> 
		<bitfield id="ND20" width="1" begin="20" end="20" resetval="0x0" description="New Data" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="ND19" width="1" begin="19" end="19" resetval="0x0" description="New Data" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="ND18" width="1" begin="18" end="18" resetval="0x0" description="New Data" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="ND17" width="1" begin="17" end="17" resetval="0x0" description="New Data" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="ND16" width="1" begin="16" end="16" resetval="0x0" description="New Data" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="ND15" width="1" begin="15" end="15" resetval="0x0" description="New Data" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="ND14" width="1" begin="14" end="14" resetval="0x0" description="New Data" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="ND13" width="1" begin="13" end="13" resetval="0x0" description="New Data" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="ND12" width="1" begin="12" end="12" resetval="0x0" description="New Data" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="ND11" width="1" begin="11" end="11" resetval="0x0" description="New Data" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="ND10" width="1" begin="10" end="10" resetval="0x0" description="New Data" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="ND9" width="1" begin="9" end="9" resetval="0x0" description="New Data" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="ND8" width="1" begin="8" end="8" resetval="0x0" description="New Data" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="ND7" width="1" begin="7" end="7" resetval="0x0" description="New Data" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="ND6" width="1" begin="6" end="6" resetval="0x0" description="New Data" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="ND5" width="1" begin="5" end="5" resetval="0x0" description="New Data" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="ND4" width="1" begin="4" end="4" resetval="0x0" description="New Data" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="ND3" width="1" begin="3" end="3" resetval="0x0" description="New Data" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="ND2" width="1" begin="2" end="2" resetval="0x0" description="New Data" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ND1" width="1" begin="1" end="1" resetval="0x0" description="New Data" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="ND0" width="1" begin="0" end="0" resetval="0x0" description="New Data" range="0" rwaccess="R/W1TC"/>
	</register>
