IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_NDAT2" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_NDAT2" offset="0x9C" width="32" description="NewDat flags of dedicated Rx buffers 32-63">
		<bitfield id="ND63" width="1" begin="31" end="31" resetval="0x0" description="New Data" range="31" rwaccess="R/W1TC"/> 
		<bitfield id="ND62" width="1" begin="30" end="30" resetval="0x0" description="New Data" range="30" rwaccess="R/W1TC"/> 
		<bitfield id="ND61" width="1" begin="29" end="29" resetval="0x0" description="New Data" range="29" rwaccess="R/W1TC"/> 
		<bitfield id="ND60" width="1" begin="28" end="28" resetval="0x0" description="New Data" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="ND59" width="1" begin="27" end="27" resetval="0x0" description="New Data" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="ND58" width="1" begin="26" end="26" resetval="0x0" description="New Data" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="ND57" width="1" begin="25" end="25" resetval="0x0" description="New Data" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="ND56" width="1" begin="24" end="24" resetval="0x0" description="New Data" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="ND55" width="1" begin="23" end="23" resetval="0x0" description="New Data" range="23" rwaccess="R/W1TC"/> 
		<bitfield id="ND54" width="1" begin="22" end="22" resetval="0x0" description="New Data" range="22" rwaccess="R/W1TC"/> 
		<bitfield id="ND53" width="1" begin="21" end="21" resetval="0x0" description="New Data" range="21" rwaccess="R/W1TC"/> 
		<bitfield id="ND52" width="1" begin="20" end="20" resetval="0x0" description="New Data" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="ND51" width="1" begin="19" end="19" resetval="0x0" description="New Data" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="ND50" width="1" begin="18" end="18" resetval="0x0" description="New Data" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="ND49" width="1" begin="17" end="17" resetval="0x0" description="New Data" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="ND48" width="1" begin="16" end="16" resetval="0x0" description="New Data" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="ND47" width="1" begin="15" end="15" resetval="0x0" description="New Data" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="ND46" width="1" begin="14" end="14" resetval="0x0" description="New Data" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="ND45" width="1" begin="13" end="13" resetval="0x0" description="New Data" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="ND44" width="1" begin="12" end="12" resetval="0x0" description="New Data" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="ND43" width="1" begin="11" end="11" resetval="0x0" description="New Data" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="ND42" width="1" begin="10" end="10" resetval="0x0" description="New Data" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="ND41" width="1" begin="9" end="9" resetval="0x0" description="New Data" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="ND40" width="1" begin="8" end="8" resetval="0x0" description="New Data" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="ND39" width="1" begin="7" end="7" resetval="0x0" description="New Data" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="ND38" width="1" begin="6" end="6" resetval="0x0" description="New Data" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="ND37" width="1" begin="5" end="5" resetval="0x0" description="New Data" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="ND36" width="1" begin="4" end="4" resetval="0x0" description="New Data" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="ND35" width="1" begin="3" end="3" resetval="0x0" description="New Data" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="ND34" width="1" begin="2" end="2" resetval="0x0" description="New Data" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ND33" width="1" begin="1" end="1" resetval="0x0" description="New Data" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="ND32" width="1" begin="0" end="0" resetval="0x0" description="New Data" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF0C" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF0C" offset="0xA0" width="32" description="FIFO 0 operation mode, watermark, size and start address">
		<bitfield id="F0OM" width="1" begin="31" end="31" resetval="0x0" description="Rx FIFO 0 Operation Mode" range="31" rwaccess="R/W"/> 
		<bitfield id="F0WM" width="7" begin="30" end="24" resetval="0x0" description="Rx FIFO 0 Watermark" range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="F0S" width="7" begin="22" end="16" resetval="0x0" description="Rx FIFO 0 Size" range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="F0SA" width="14" begin="15" end="2" resetval="0x0" description="Rx FIFO 0 Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF0S" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF0S" offset="0xA4" width="32" description="FIFO 0 message lost/full indication, put index, get index and fill level">
		<bitfield id="RF0L" width="1" begin="25" end="25" resetval="0x0" description="Rx FIFO 0 Message Lost" range="25" rwaccess="R"/> 
		<bitfield id="F0F" width="1" begin="24" end="24" resetval="0x0" description="Rx FIFO 0 Full" range="24" rwaccess="R"/> 
		<bitfield id="F0PI" width="6" begin="21" end="16" resetval="0x0" description="Rx FIFO 0 Put Index" range="21 - 16" rwaccess="R"/> 
		<bitfield id="F0GI" width="6" begin="13" end="8" resetval="0x0" description="Rx FIFO 0 Get Index" range="13 - 8" rwaccess="R"/> 
		<bitfield id="F0FL" width="7" begin="6" end="0" resetval="0x0" description="Rx FIFO 0 Fill Level" range="6 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF0A" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF0A" offset="0xA8" width="32" description="FIFO 0 acknowledge last index of read buffers, updates get index and fill level">
		<bitfield id="F0AI" width="6" begin="5" end="0" resetval="0x0" description="Rx FIFO 0 Acknowledge Index" range="5 - 0" rwaccess="R/W"/>
	</register>
