IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXBC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXBC" offset="0xAC" width="32" description="Start address of Rx buffer section">
		<bitfield id="RBSA" width="14" begin="15" end="2" resetval="0x0" description="Rx Buffer Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF1C" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF1C" offset="0xB0" width="32" description="FIFO 1 operation mode, watermark, size and start address">
		<bitfield id="F1OM" width="1" begin="31" end="31" resetval="0x0" description="Rx FIFO 1 Operation Mode" range="31" rwaccess="R/W"/> 
		<bitfield id="F1WM" width="7" begin="30" end="24" resetval="0x0" description="Rx FIFO 1 Watermark" range="30 - 24" rwaccess="R/W"/> 
		<bitfield id="F1S" width="7" begin="22" end="16" resetval="0x0" description="Rx FIFO 1 Size" range="22 - 16" rwaccess="R/W"/> 
		<bitfield id="F1SA" width="14" begin="15" end="2" resetval="0x0" description="Rx FIFO 1 Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF1S" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF1S" offset="0xB4" width="32" description="FIFO 1 message lost/full indication, put index, get index and fill level">
		<bitfield id="DMS" width="2" begin="31" end="30" resetval="0x0" description="Debug Message Status" range="31 - 30" rwaccess="R"/> 
		<bitfield id="RF1L" width="1" begin="25" end="25" resetval="0x0" description="Rx FIFO 1 Message Lost" range="25" rwaccess="R"/> 
		<bitfield id="F1F" width="1" begin="24" end="24" resetval="0x0" description="Rx FIFO 1 Full" range="24" rwaccess="R"/> 
		<bitfield id="F1PI" width="6" begin="21" end="16" resetval="0x0" description="Rx FIFO 1 Put Index" range="21 - 16" rwaccess="R"/> 
		<bitfield id="F1GI" width="6" begin="13" end="8" resetval="0x0" description="Rx FIFO 1 Get Index" range="13 - 8" rwaccess="R"/> 
		<bitfield id="F1FL" width="7" begin="6" end="0" resetval="0x0" description="Rx FIFO 1 Fill Level" range="6 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF1A" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXF1A" offset="0xB8" width="32" description="FIFO 1 acknowledge last index of read buffers, updates get index and fill level">
		<bitfield id="F1AI" width="6" begin="5" end="0" resetval="0x0" description="Rx FIFO 1 Acknowledge Index" range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXESC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_RXESC" offset="0xBC" width="32" description="Configure data field size for storage of accepted frames">
		<bitfield id="RBDS" width="3" begin="10" end="8" resetval="0x0" description="Rx Buffer data Field Size" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="F1DS" width="3" begin="6" end="4" resetval="0x0" description="Rx FIFO 1 Data Field Size" range="6 - 4" rwaccess="R/W"/> 
		<bitfield id="F0DS" width="3" begin="2" end="0" resetval="0x0" description="Rx FIFO 0 Data Field Size" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBC" offset="0xC0" width="32" description="Configure Tx FIFO/Queue mode, Tx FIFO/Queue size, number of dedicated Tx buffers, Tx buffer start address">
		<bitfield id="TFQM" width="1" begin="30" end="30" resetval="0x0" description="Tx FIFO/Queue Mode" range="30" rwaccess="R/W"/> 
		<bitfield id="TFQS" width="6" begin="29" end="24" resetval="0x0" description="Transmit FIFO/Queue Size" range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="NDTB" width="6" begin="21" end="16" resetval="0x0" description="Number of Dedicated Transmit Buffers" range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TBSA" width="14" begin="15" end="2" resetval="0x0" description="Tx Buffers Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXFQS" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXFQS" offset="0xC4" width="32" description="Tx FIFO/Queue full indication and put index, Tx FIFO get index and fill level">
		<bitfield id="TFQF" width="1" begin="21" end="21" resetval="0x0" description="Tx FIFO/Queue Full" range="21" rwaccess="R"/> 
		<bitfield id="TFQPI" width="5" begin="20" end="16" resetval="0x0" description="Tx FIFO/Queue Put Index" range="20 - 16" rwaccess="R"/> 
		<bitfield id="TFGI" width="5" begin="12" end="8" resetval="0x0" description="Tx Queue Get Index" range="12 - 8" rwaccess="R"/> 
		<bitfield id="TFFL" width="6" begin="5" end="0" resetval="0x0" description="Tx FIFO Free Level" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXESC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXESC" offset="0xC8" width="32" description="Configure data field size for frame transmission">
		<bitfield id="TBDS" width="3" begin="2" end="0" resetval="0x0" description="Tx Buffer Data Field Size" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBRP" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBRP" offset="0xCC" width="32" description="Tx buffers with pending transmission request">
		<bitfield id="TRP31" width="1" begin="31" end="31" resetval="0x0" description="Transmission Request Pending" range="31" rwaccess="R"/> 
		<bitfield id="TRP30" width="1" begin="30" end="30" resetval="0x0" description="Transmission Request Pending" range="30" rwaccess="R"/> 
		<bitfield id="TRP29" width="1" begin="29" end="29" resetval="0x0" description="Transmission Request Pending" range="29" rwaccess="R"/> 
		<bitfield id="TRP28" width="1" begin="28" end="28" resetval="0x0" description="Transmission Request Pending" range="28" rwaccess="R"/> 
		<bitfield id="TRP27" width="1" begin="27" end="27" resetval="0x0" description="Transmission Request Pending" range="27" rwaccess="R"/> 
		<bitfield id="TRP26" width="1" begin="26" end="26" resetval="0x0" description="Transmission Request Pending" range="26" rwaccess="R"/> 
		<bitfield id="TRP25" width="1" begin="25" end="25" resetval="0x0" description="Transmission Request Pending" range="25" rwaccess="R"/> 
		<bitfield id="TRP24" width="1" begin="24" end="24" resetval="0x0" description="Transmission Request Pending" range="24" rwaccess="R"/> 
		<bitfield id="TRP23" width="1" begin="23" end="23" resetval="0x0" description="Transmission Request Pending" range="23" rwaccess="R"/> 
		<bitfield id="TRP22" width="1" begin="22" end="22" resetval="0x0" description="Transmission Request Pending" range="22" rwaccess="R"/> 
		<bitfield id="TRP21" width="1" begin="21" end="21" resetval="0x0" description="Transmission Request Pending" range="21" rwaccess="R"/> 
		<bitfield id="TRP20" width="1" begin="20" end="20" resetval="0x0" description="Transmission Request Pending" range="20" rwaccess="R"/> 
		<bitfield id="TRP19" width="1" begin="19" end="19" resetval="0x0" description="Transmission Request Pending" range="19" rwaccess="R"/> 
		<bitfield id="TRP18" width="1" begin="18" end="18" resetval="0x0" description="Transmission Request Pending" range="18" rwaccess="R"/> 
		<bitfield id="TRP17" width="1" begin="17" end="17" resetval="0x0" description="Transmission Request Pending" range="17" rwaccess="R"/> 
		<bitfield id="TRP16" width="1" begin="16" end="16" resetval="0x0" description="Transmission Request Pending" range="16" rwaccess="R"/> 
		<bitfield id="TRP15" width="1" begin="15" end="15" resetval="0x0" description="Transmission Request Pending" range="15" rwaccess="R"/> 
		<bitfield id="TRP14" width="1" begin="14" end="14" resetval="0x0" description="Transmission Request Pending" range="14" rwaccess="R"/> 
		<bitfield id="TRP13" width="1" begin="13" end="13" resetval="0x0" description="Transmission Request Pending" range="13" rwaccess="R"/> 
		<bitfield id="TRP12" width="1" begin="12" end="12" resetval="0x0" description="Transmission Request Pending" range="12" rwaccess="R"/> 
		<bitfield id="TRP11" width="1" begin="11" end="11" resetval="0x0" description="Transmission Request Pending" range="11" rwaccess="R"/> 
		<bitfield id="TRP10" width="1" begin="10" end="10" resetval="0x0" description="Transmission Request Pending" range="10" rwaccess="R"/> 
		<bitfield id="TRP9" width="1" begin="9" end="9" resetval="0x0" description="Transmission Request Pending" range="9" rwaccess="R"/> 
		<bitfield id="TRP8" width="1" begin="8" end="8" resetval="0x0" description="Transmission Request Pending" range="8" rwaccess="R"/> 
		<bitfield id="TRP7" width="1" begin="7" end="7" resetval="0x0" description="Transmission Request Pending" range="7" rwaccess="R"/> 
		<bitfield id="TRP6" width="1" begin="6" end="6" resetval="0x0" description="Transmission Request Pending" range="6" rwaccess="R"/> 
		<bitfield id="TRP5" width="1" begin="5" end="5" resetval="0x0" description="Transmission Request Pending" range="5" rwaccess="R"/> 
		<bitfield id="TRP4" width="1" begin="4" end="4" resetval="0x0" description="Transmission Request Pending" range="4" rwaccess="R"/> 
		<bitfield id="TRP3" width="1" begin="3" end="3" resetval="0x0" description="Transmission Request Pending" range="3" rwaccess="R"/> 
		<bitfield id="TRP2" width="1" begin="2" end="2" resetval="0x0" description="Transmission Request Pending" range="2" rwaccess="R"/> 
		<bitfield id="TRP1" width="1" begin="1" end="1" resetval="0x0" description="Transmission Request Pending" range="1" rwaccess="R"/> 
		<bitfield id="TRP0" width="1" begin="0" end="0" resetval="0x0" description="Transmission Request Pending" range="0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBAR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBAR" offset="0xD0" width="32" description="Add transmission requests">
		<bitfield id="AR31" width="1" begin="31" end="31" resetval="0x0" description="Add request" range="31" rwaccess="R/W1TC"/> 
		<bitfield id="AR30" width="1" begin="30" end="30" resetval="0x0" description="Add request" range="30" rwaccess="R/W1TC"/> 
		<bitfield id="AR29" width="1" begin="29" end="29" resetval="0x0" description="Add request" range="29" rwaccess="R/W1TC"/> 
		<bitfield id="AR28" width="1" begin="28" end="28" resetval="0x0" description="Add request" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="AR27" width="1" begin="27" end="27" resetval="0x0" description="Add request" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="AR26" width="1" begin="26" end="26" resetval="0x0" description="Add request" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="AR25" width="1" begin="25" end="25" resetval="0x0" description="Add request" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="AR24" width="1" begin="24" end="24" resetval="0x0" description="Add request" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="AR23" width="1" begin="23" end="23" resetval="0x0" description="Add request" range="23" rwaccess="R/W1TC"/> 
		<bitfield id="AR22" width="1" begin="22" end="22" resetval="0x0" description="Add request" range="22" rwaccess="R/W1TC"/> 
		<bitfield id="AR21" width="1" begin="21" end="21" resetval="0x0" description="Add request" range="21" rwaccess="R/W1TC"/> 
		<bitfield id="AR20" width="1" begin="20" end="20" resetval="0x0" description="Add request" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="AR19" width="1" begin="19" end="19" resetval="0x0" description="Add request" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="AR18" width="1" begin="18" end="18" resetval="0x0" description="Add request" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="AR17" width="1" begin="17" end="17" resetval="0x0" description="Add request" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="AR16" width="1" begin="16" end="16" resetval="0x0" description="Add request" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="AR15" width="1" begin="15" end="15" resetval="0x0" description="Add request" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="AR14" width="1" begin="14" end="14" resetval="0x0" description="Add request" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="AR13" width="1" begin="13" end="13" resetval="0x0" description="Add request" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="AR12" width="1" begin="12" end="12" resetval="0x0" description="Add request" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="AR11" width="1" begin="11" end="11" resetval="0x0" description="Add request" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="AR10" width="1" begin="10" end="10" resetval="0x0" description="Add request" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="AR9" width="1" begin="9" end="9" resetval="0x0" description="Add request" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="AR8" width="1" begin="8" end="8" resetval="0x0" description="Add request" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="AR7" width="1" begin="7" end="7" resetval="0x0" description="Add request" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="AR6" width="1" begin="6" end="6" resetval="0x0" description="Add request" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="AR5" width="1" begin="5" end="5" resetval="0x0" description="Add request" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="AR4" width="1" begin="4" end="4" resetval="0x0" description="Add request" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="AR3" width="1" begin="3" end="3" resetval="0x0" description="Add request" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="AR2" width="1" begin="2" end="2" resetval="0x0" description="Add request" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="AR1" width="1" begin="1" end="1" resetval="0x0" description="Add request" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="AR0" width="1" begin="0" end="0" resetval="0x0" description="Add request" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBCR" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBCR" offset="0xD4" width="32" description="Request cancellation of pending transmissions">
		<bitfield id="CR31" width="1" begin="31" end="31" resetval="0x0" description="Cancellation Request" range="31" rwaccess="R/W1TC"/> 
		<bitfield id="CR30" width="1" begin="30" end="30" resetval="0x0" description="Cancellation Request" range="30" rwaccess="R/W1TC"/> 
		<bitfield id="CR29" width="1" begin="29" end="29" resetval="0x0" description="Cancellation Request" range="29" rwaccess="R/W1TC"/> 
		<bitfield id="CR28" width="1" begin="28" end="28" resetval="0x0" description="Cancellation Request" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="CR27" width="1" begin="27" end="27" resetval="0x0" description="Cancellation Request" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="CR26" width="1" begin="26" end="26" resetval="0x0" description="Cancellation Request" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="CR25" width="1" begin="25" end="25" resetval="0x0" description="Cancellation Request" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="CR24" width="1" begin="24" end="24" resetval="0x0" description="Cancellation Request" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="CR23" width="1" begin="23" end="23" resetval="0x0" description="Cancellation Request" range="23" rwaccess="R/W1TC"/> 
		<bitfield id="CR22" width="1" begin="22" end="22" resetval="0x0" description="Cancellation Request" range="22" rwaccess="R/W1TC"/> 
		<bitfield id="CR21" width="1" begin="21" end="21" resetval="0x0" description="Cancellation Request" range="21" rwaccess="R/W1TC"/> 
		<bitfield id="CR20" width="1" begin="20" end="20" resetval="0x0" description="Cancellation Request" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="CR19" width="1" begin="19" end="19" resetval="0x0" description="Cancellation Request" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="CR18" width="1" begin="18" end="18" resetval="0x0" description="Cancellation Request" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="CR17" width="1" begin="17" end="17" resetval="0x0" description="Cancellation Request" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CR16" width="1" begin="16" end="16" resetval="0x0" description="Cancellation Request" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="CR15" width="1" begin="15" end="15" resetval="0x0" description="Cancellation Request" range="15" rwaccess="R/W1TC"/> 
		<bitfield id="CR14" width="1" begin="14" end="14" resetval="0x0" description="Cancellation Request" range="14" rwaccess="R/W1TC"/> 
		<bitfield id="CR13" width="1" begin="13" end="13" resetval="0x0" description="Cancellation Request" range="13" rwaccess="R/W1TC"/> 
		<bitfield id="CR12" width="1" begin="12" end="12" resetval="0x0" description="Cancellation Request" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="CR11" width="1" begin="11" end="11" resetval="0x0" description="Cancellation Request" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="CR10" width="1" begin="10" end="10" resetval="0x0" description="Cancellation Request" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="CR9" width="1" begin="9" end="9" resetval="0x0" description="Cancellation Request" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CR8" width="1" begin="8" end="8" resetval="0x0" description="Cancellation Request" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CR7" width="1" begin="7" end="7" resetval="0x0" description="Cancellation Request" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="CR6" width="1" begin="6" end="6" resetval="0x0" description="Cancellation Request" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="CR5" width="1" begin="5" end="5" resetval="0x0" description="Cancellation Request" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="CR4" width="1" begin="4" end="4" resetval="0x0" description="Cancellation Request" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CR3" width="1" begin="3" end="3" resetval="0x0" description="Cancellation Request" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="CR2" width="1" begin="2" end="2" resetval="0x0" description="Cancellation Request" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="CR1" width="1" begin="1" end="1" resetval="0x0" description="Cancellation Request" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CR0" width="1" begin="0" end="0" resetval="0x0" description="Cancellation Request" range="0" rwaccess="R/W1TC"/>
	</register>
