IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBTO" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBTO" offset="0xD8" width="32" description="Signals successful transmissions, set when corresponding TXBRP flag is cleared">
		<bitfield id="TO31" width="1" begin="31" end="31" resetval="0x0" description="Transmission Occurred" range="31" rwaccess="R"/> 
		<bitfield id="TO30" width="1" begin="30" end="30" resetval="0x0" description="Transmission Occurred" range="30" rwaccess="R"/> 
		<bitfield id="TO29" width="1" begin="29" end="29" resetval="0x0" description="Transmission Occurred" range="29" rwaccess="R"/> 
		<bitfield id="TO28" width="1" begin="28" end="28" resetval="0x0" description="Transmission Occurred" range="28" rwaccess="R"/> 
		<bitfield id="TO27" width="1" begin="27" end="27" resetval="0x0" description="Transmission Occurred" range="27" rwaccess="R"/> 
		<bitfield id="TO26" width="1" begin="26" end="26" resetval="0x0" description="Transmission Occurred" range="26" rwaccess="R"/> 
		<bitfield id="TO25" width="1" begin="25" end="25" resetval="0x0" description="Transmission Occurred" range="25" rwaccess="R"/> 
		<bitfield id="TO24" width="1" begin="24" end="24" resetval="0x0" description="Transmission Occurred" range="24" rwaccess="R"/> 
		<bitfield id="TO23" width="1" begin="23" end="23" resetval="0x0" description="Transmission Occurred" range="23" rwaccess="R"/> 
		<bitfield id="TO22" width="1" begin="22" end="22" resetval="0x0" description="Transmission Occurred" range="22" rwaccess="R"/> 
		<bitfield id="TO21" width="1" begin="21" end="21" resetval="0x0" description="Transmission Occurred" range="21" rwaccess="R"/> 
		<bitfield id="TO20" width="1" begin="20" end="20" resetval="0x0" description="Transmission Occurred" range="20" rwaccess="R"/> 
		<bitfield id="TO19" width="1" begin="19" end="19" resetval="0x0" description="Transmission Occurred" range="19" rwaccess="R"/> 
		<bitfield id="TO18" width="1" begin="18" end="18" resetval="0x0" description="Transmission Occurred" range="18" rwaccess="R"/> 
		<bitfield id="TO17" width="1" begin="17" end="17" resetval="0x0" description="Transmission Occurred" range="17" rwaccess="R"/> 
		<bitfield id="TO16" width="1" begin="16" end="16" resetval="0x0" description="Transmission Occurred" range="16" rwaccess="R"/> 
		<bitfield id="TO15" width="1" begin="15" end="15" resetval="0x0" description="Transmission Occurred" range="15" rwaccess="R"/> 
		<bitfield id="TO14" width="1" begin="14" end="14" resetval="0x0" description="Transmission Occurred" range="14" rwaccess="R"/> 
		<bitfield id="TO13" width="1" begin="13" end="13" resetval="0x0" description="Transmission Occurred" range="13" rwaccess="R"/> 
		<bitfield id="TO12" width="1" begin="12" end="12" resetval="0x0" description="Transmission Occurred" range="12" rwaccess="R"/> 
		<bitfield id="TO11" width="1" begin="11" end="11" resetval="0x0" description="Transmission Occurred" range="11" rwaccess="R"/> 
		<bitfield id="TO10" width="1" begin="10" end="10" resetval="0x0" description="Transmission Occurred" range="10" rwaccess="R"/> 
		<bitfield id="TO9" width="1" begin="9" end="9" resetval="0x0" description="Transmission Occurred" range="9" rwaccess="R"/> 
		<bitfield id="TO8" width="1" begin="8" end="8" resetval="0x0" description="Transmission Occurred" range="8" rwaccess="R"/> 
		<bitfield id="TO7" width="1" begin="7" end="7" resetval="0x0" description="Transmission Occurred" range="7" rwaccess="R"/> 
		<bitfield id="TO6" width="1" begin="6" end="6" resetval="0x0" description="Transmission Occurred" range="6" rwaccess="R"/> 
		<bitfield id="TO5" width="1" begin="5" end="5" resetval="0x0" description="Transmission Occurred" range="5" rwaccess="R"/> 
		<bitfield id="TO4" width="1" begin="4" end="4" resetval="0x0" description="Transmission Occurred" range="4" rwaccess="R"/> 
		<bitfield id="TO3" width="1" begin="3" end="3" resetval="0x0" description="Transmission Occurred" range="3" rwaccess="R"/> 
		<bitfield id="TO2" width="1" begin="2" end="2" resetval="0x0" description="Transmission Occurred" range="2" rwaccess="R"/> 
		<bitfield id="TO1" width="1" begin="1" end="1" resetval="0x0" description="Transmission Occurred" range="1" rwaccess="R"/> 
		<bitfield id="TO0" width="1" begin="0" end="0" resetval="0x0" description="Transmission Occurred" range="0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBCF" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBCF" offset="0xDC" width="32" description="Signals successful transmit cancellation, set when corresponding TXBRP flag is cleared after cancellation request">
		<bitfield id="CF31" width="1" begin="31" end="31" resetval="0x0" description="Cancellation Finished" range="31" rwaccess="R"/> 
		<bitfield id="CF30" width="1" begin="30" end="30" resetval="0x0" description="Cancellation Finished" range="30" rwaccess="R"/> 
		<bitfield id="CF29" width="1" begin="29" end="29" resetval="0x0" description="Cancellation Finished" range="29" rwaccess="R"/> 
		<bitfield id="CF28" width="1" begin="28" end="28" resetval="0x0" description="Cancellation Finished" range="28" rwaccess="R"/> 
		<bitfield id="CF27" width="1" begin="27" end="27" resetval="0x0" description="Cancellation Finished" range="27" rwaccess="R"/> 
		<bitfield id="CF26" width="1" begin="26" end="26" resetval="0x0" description="Cancellation Finished" range="26" rwaccess="R"/> 
		<bitfield id="CF25" width="1" begin="25" end="25" resetval="0x0" description="Cancellation Finished" range="25" rwaccess="R"/> 
		<bitfield id="CF24" width="1" begin="24" end="24" resetval="0x0" description="Cancellation Finished" range="24" rwaccess="R"/> 
		<bitfield id="CF23" width="1" begin="23" end="23" resetval="0x0" description="Cancellation Finished" range="23" rwaccess="R"/> 
		<bitfield id="CF22" width="1" begin="22" end="22" resetval="0x0" description="Cancellation Finished" range="22" rwaccess="R"/> 
		<bitfield id="CF21" width="1" begin="21" end="21" resetval="0x0" description="Cancellation Finished" range="21" rwaccess="R"/> 
		<bitfield id="CF20" width="1" begin="20" end="20" resetval="0x0" description="Cancellation Finished" range="20" rwaccess="R"/> 
		<bitfield id="CF19" width="1" begin="19" end="19" resetval="0x0" description="Cancellation Finished" range="19" rwaccess="R"/> 
		<bitfield id="CF18" width="1" begin="18" end="18" resetval="0x0" description="Cancellation Finished" range="18" rwaccess="R"/> 
		<bitfield id="CF17" width="1" begin="17" end="17" resetval="0x0" description="Cancellation Finished" range="17" rwaccess="R"/> 
		<bitfield id="CF16" width="1" begin="16" end="16" resetval="0x0" description="Cancellation Finished" range="16" rwaccess="R"/> 
		<bitfield id="CF15" width="1" begin="15" end="15" resetval="0x0" description="Cancellation Finished" range="15" rwaccess="R"/> 
		<bitfield id="CF14" width="1" begin="14" end="14" resetval="0x0" description="Cancellation Finished" range="14" rwaccess="R"/> 
		<bitfield id="CF13" width="1" begin="13" end="13" resetval="0x0" description="Cancellation Finished" range="13" rwaccess="R"/> 
		<bitfield id="CF12" width="1" begin="12" end="12" resetval="0x0" description="Cancellation Finished" range="12" rwaccess="R"/> 
		<bitfield id="CF11" width="1" begin="11" end="11" resetval="0x0" description="Cancellation Finished" range="11" rwaccess="R"/> 
		<bitfield id="CF10" width="1" begin="10" end="10" resetval="0x0" description="Cancellation Finished" range="10" rwaccess="R"/> 
		<bitfield id="CF9" width="1" begin="9" end="9" resetval="0x0" description="Cancellation Finished" range="9" rwaccess="R"/> 
		<bitfield id="CF8" width="1" begin="8" end="8" resetval="0x0" description="Cancellation Finished" range="8" rwaccess="R"/> 
		<bitfield id="CF7" width="1" begin="7" end="7" resetval="0x0" description="Cancellation Finished" range="7" rwaccess="R"/> 
		<bitfield id="CF6" width="1" begin="6" end="6" resetval="0x0" description="Cancellation Finished" range="6" rwaccess="R"/> 
		<bitfield id="CF5" width="1" begin="5" end="5" resetval="0x0" description="Cancellation Finished" range="5" rwaccess="R"/> 
		<bitfield id="CF4" width="1" begin="4" end="4" resetval="0x0" description="Cancellation Finished" range="4" rwaccess="R"/> 
		<bitfield id="CF3" width="1" begin="3" end="3" resetval="0x0" description="Cancellation Finished" range="3" rwaccess="R"/> 
		<bitfield id="CF2" width="1" begin="2" end="2" resetval="0x0" description="Cancellation Finished" range="2" rwaccess="R"/> 
		<bitfield id="CF1" width="1" begin="1" end="1" resetval="0x0" description="Cancellation Finished" range="1" rwaccess="R"/> 
		<bitfield id="CF0" width="1" begin="0" end="0" resetval="0x0" description="Cancellation Finished" range="0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBTIE" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBTIE" offset="0xE0" width="32" description="Enable transmit interrupts for selected Tx buffers">
		<bitfield id="TIE31" width="1" begin="31" end="31" resetval="0x0" description="Transmission Interrupt Enable" range="31" rwaccess="R/W"/> 
		<bitfield id="TIE30" width="1" begin="30" end="30" resetval="0x0" description="Transmission Interrupt Enable" range="30" rwaccess="R/W"/> 
		<bitfield id="TIE29" width="1" begin="29" end="29" resetval="0x0" description="Transmission Interrupt Enable" range="29" rwaccess="R/W"/> 
		<bitfield id="TIE28" width="1" begin="28" end="28" resetval="0x0" description="Transmission Interrupt Enable" range="28" rwaccess="R/W"/> 
		<bitfield id="TIE27" width="1" begin="27" end="27" resetval="0x0" description="Transmission Interrupt Enable" range="27" rwaccess="R/W"/> 
		<bitfield id="TIE26" width="1" begin="26" end="26" resetval="0x0" description="Transmission Interrupt Enable" range="26" rwaccess="R/W"/> 
		<bitfield id="TIE25" width="1" begin="25" end="25" resetval="0x0" description="Transmission Interrupt Enable" range="25" rwaccess="R/W"/> 
		<bitfield id="TIE24" width="1" begin="24" end="24" resetval="0x0" description="Transmission Interrupt Enable" range="24" rwaccess="R/W"/> 
		<bitfield id="TIE23" width="1" begin="23" end="23" resetval="0x0" description="Transmission Interrupt Enable" range="23" rwaccess="R/W"/> 
		<bitfield id="TIE22" width="1" begin="22" end="22" resetval="0x0" description="Transmission Interrupt Enable" range="22" rwaccess="R/W"/> 
		<bitfield id="TIE21" width="1" begin="21" end="21" resetval="0x0" description="Transmission Interrupt Enable" range="21" rwaccess="R/W"/> 
		<bitfield id="TIE20" width="1" begin="20" end="20" resetval="0x0" description="Transmission Interrupt Enable" range="20" rwaccess="R/W"/> 
		<bitfield id="TIE19" width="1" begin="19" end="19" resetval="0x0" description="Transmission Interrupt Enable" range="19" rwaccess="R/W"/> 
		<bitfield id="TIE18" width="1" begin="18" end="18" resetval="0x0" description="Transmission Interrupt Enable" range="18" rwaccess="R/W"/> 
		<bitfield id="TIE17" width="1" begin="17" end="17" resetval="0x0" description="Transmission Interrupt Enable" range="17" rwaccess="R/W"/> 
		<bitfield id="TIE16" width="1" begin="16" end="16" resetval="0x0" description="Transmission Interrupt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TIE15" width="1" begin="15" end="15" resetval="0x0" description="Transmission Interrupt Enable" range="15" rwaccess="R/W"/> 
		<bitfield id="TIE14" width="1" begin="14" end="14" resetval="0x0" description="Transmission Interrupt Enable" range="14" rwaccess="R/W"/> 
		<bitfield id="TIE13" width="1" begin="13" end="13" resetval="0x0" description="Transmission Interrupt Enable" range="13" rwaccess="R/W"/> 
		<bitfield id="TIE12" width="1" begin="12" end="12" resetval="0x0" description="Transmission Interrupt Enable" range="12" rwaccess="R/W"/> 
		<bitfield id="TIE11" width="1" begin="11" end="11" resetval="0x0" description="Transmission Interrupt Enable" range="11" rwaccess="R/W"/> 
		<bitfield id="TIE10" width="1" begin="10" end="10" resetval="0x0" description="Transmission Interrupt Enable" range="10" rwaccess="R/W"/> 
		<bitfield id="TIE9" width="1" begin="9" end="9" resetval="0x0" description="Transmission Interrupt Enable" range="9" rwaccess="R/W"/> 
		<bitfield id="TIE8" width="1" begin="8" end="8" resetval="0x0" description="Transmission Interrupt Enable" range="8" rwaccess="R/W"/> 
		<bitfield id="TIE7" width="1" begin="7" end="7" resetval="0x0" description="Transmission Interrupt Enable" range="7" rwaccess="R/W"/> 
		<bitfield id="TIE6" width="1" begin="6" end="6" resetval="0x0" description="Transmission Interrupt Enable" range="6" rwaccess="R/W"/> 
		<bitfield id="TIE5" width="1" begin="5" end="5" resetval="0x0" description="Transmission Interrupt Enable" range="5" rwaccess="R/W"/> 
		<bitfield id="TIE4" width="1" begin="4" end="4" resetval="0x0" description="Transmission Interrupt Enable" range="4" rwaccess="R/W"/> 
		<bitfield id="TIE3" width="1" begin="3" end="3" resetval="0x0" description="Transmission Interrupt Enable" range="3" rwaccess="R/W"/> 
		<bitfield id="TIE2" width="1" begin="2" end="2" resetval="0x0" description="Transmission Interrupt Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="TIE1" width="1" begin="1" end="1" resetval="0x0" description="Transmission Interrupt Enable" range="1" rwaccess="R/W"/> 
		<bitfield id="TIE0" width="1" begin="0" end="0" resetval="0x0" description="Transmission Interrupt Enable" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBCIE" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXBCIE" offset="0xE4" width="32" description="Enable cancellation finished interrupts for selected Tx buffers">
		<bitfield id="CFIE31" width="1" begin="31" end="31" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="31" rwaccess="R/W"/> 
		<bitfield id="CFIE30" width="1" begin="30" end="30" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="30" rwaccess="R/W"/> 
		<bitfield id="CFIE29" width="1" begin="29" end="29" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="29" rwaccess="R/W"/> 
		<bitfield id="CFIE28" width="1" begin="28" end="28" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="28" rwaccess="R/W"/> 
		<bitfield id="CFIE27" width="1" begin="27" end="27" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="27" rwaccess="R/W"/> 
		<bitfield id="CFIE26" width="1" begin="26" end="26" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="26" rwaccess="R/W"/> 
		<bitfield id="CFIE25" width="1" begin="25" end="25" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="25" rwaccess="R/W"/> 
		<bitfield id="CFIE24" width="1" begin="24" end="24" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="24" rwaccess="R/W"/> 
		<bitfield id="CFIE23" width="1" begin="23" end="23" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="23" rwaccess="R/W"/> 
		<bitfield id="CFIE22" width="1" begin="22" end="22" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="22" rwaccess="R/W"/> 
		<bitfield id="CFIE21" width="1" begin="21" end="21" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="21" rwaccess="R/W"/> 
		<bitfield id="CFIE20" width="1" begin="20" end="20" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="20" rwaccess="R/W"/> 
		<bitfield id="CFIE19" width="1" begin="19" end="19" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="19" rwaccess="R/W"/> 
		<bitfield id="CFIE18" width="1" begin="18" end="18" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="18" rwaccess="R/W"/> 
		<bitfield id="CFIE17" width="1" begin="17" end="17" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="17" rwaccess="R/W"/> 
		<bitfield id="CFIE16" width="1" begin="16" end="16" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="CFIE15" width="1" begin="15" end="15" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="15" rwaccess="R/W"/> 
		<bitfield id="CFIE14" width="1" begin="14" end="14" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="14" rwaccess="R/W"/> 
		<bitfield id="CFIE13" width="1" begin="13" end="13" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="13" rwaccess="R/W"/> 
		<bitfield id="CFIE12" width="1" begin="12" end="12" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="12" rwaccess="R/W"/> 
		<bitfield id="CFIE11" width="1" begin="11" end="11" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="11" rwaccess="R/W"/> 
		<bitfield id="CFIE10" width="1" begin="10" end="10" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="10" rwaccess="R/W"/> 
		<bitfield id="CFIE9" width="1" begin="9" end="9" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="9" rwaccess="R/W"/> 
		<bitfield id="CFIE8" width="1" begin="8" end="8" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="8" rwaccess="R/W"/> 
		<bitfield id="CFIE7" width="1" begin="7" end="7" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="7" rwaccess="R/W"/> 
		<bitfield id="CFIE6" width="1" begin="6" end="6" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="6" rwaccess="R/W"/> 
		<bitfield id="CFIE5" width="1" begin="5" end="5" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="5" rwaccess="R/W"/> 
		<bitfield id="CFIE4" width="1" begin="4" end="4" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="4" rwaccess="R/W"/> 
		<bitfield id="CFIE3" width="1" begin="3" end="3" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="3" rwaccess="R/W"/> 
		<bitfield id="CFIE2" width="1" begin="2" end="2" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="CFIE1" width="1" begin="1" end="1" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="1" rwaccess="R/W"/> 
		<bitfield id="CFIE0" width="1" begin="0" end="0" resetval="0x0" description="Cancellation Finished Interrupt Enable" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1414" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1414" offset="0xE8" width="32" description="Reserved Field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1515" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1515" offset="0xEC" width="32" description="Reserved Field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXEFC" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXEFC" offset="0xF0" width="32" description="Tx event FIFO watermark, size and start address">
		<bitfield id="EFWM" width="6" begin="29" end="24" resetval="0x0" description="Event FIFO Watermark" range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="EFS" width="6" begin="21" end="16" resetval="0x0" description="Event FIFO Size" range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="EFSA" width="14" begin="15" end="2" resetval="0x0" description="Event FIFO Start Address" range="15 - 2" rwaccess="R/W"/>
	</register>
