IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCAN1_CFG.xml
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXEFS" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXEFS" offset="0xF4" width="32" description="Tx event FIFO element lost/full indication, put index, get index, and fill level">
		<bitfield id="TEFL" width="1" begin="25" end="25" resetval="0x0" description="Tx Event FIFO Element Lost" range="25" rwaccess="R"/> 
		<bitfield id="EFF" width="1" begin="24" end="24" resetval="0x0" description="Event FIFO Full" range="24" rwaccess="R"/> 
		<bitfield id="EFPI" width="5" begin="20" end="16" resetval="0x0" description="Event FIFO Put Index" range="20 - 16" rwaccess="R"/> 
		<bitfield id="EFGI" width="5" begin="12" end="8" resetval="0x0" description="Event FIFO Get Index" range="12 - 8" rwaccess="R"/> 
		<bitfield id="EFFL" width="6" begin="5" end="0" resetval="0x0" description="Event FIFO Fill Level" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXEFA" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_TXEFA" offset="0xF8" width="32" description="Tx event FIFO acknowledge last index of read elements, updates get index and fill level">
		<bitfield id="EFAI" width="5" begin="4" end="0" resetval="0x0" description="Event FIFO Acknowledge Index" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1616" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_reserved1616" offset="0xFC" width="32" description="Reserved Field">
		
	</register>
	<register id="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ReservUpper256" acronym="MCAN_WRAP__MCAN_CFG_VBP__MCAN_REGS_ReservUpper256" offset="0x100" width="32" description="Reserved Field">
		
	</register>
</module>